Public Attributes | List of all members
API_AnalyticalSurfaceLoad_Settings Struct Reference
Analytical Model
Describes the Structural Analytical Model Analytical Surface Load settings. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
API_Guid  | loadCaseId
The guid of the connected Load Case.
API_AnalyticalCoordSysDirection  | coordinateSystemType
Defines the co-ordinate system of the member in which the load is applied. For " Local", coordinate system is defined by the member where is load applied.
double  | xValue
The force/moment value in X direction of the Analytical Surface Load.
double  | yValue
The force/moment value in Y direction of the Analytical Surface Load.
double  | zValue
The force/moment value in Z direction of the Analytical Surface Load.
Detailed Description
Describes the Structural Analytical Model Analytical Surface Load settings.
Since
Archicad 25
Member Data Documentation
◆ coordinateSystemType
 API_AnalyticalSurfaceLoad_Settings::coordinateSystemType
Defines the co-ordinate system of the member in which the load is applied. For " Local", coordinate system is defined by the member where is load applied.
◆ loadCaseId
 API_AnalyticalSurfaceLoad_Settings::loadCaseId
The guid of the connected Load Case.
◆ xValue
 API_AnalyticalSurfaceLoad_Settings::xValue
The force/moment value in X direction of the Analytical Surface Load.
◆ yValue
 API_AnalyticalSurfaceLoad_Settings::yValue
The force/moment value in Y direction of the Analytical Surface Load.
◆ zValue
 API_AnalyticalSurfaceLoad_Settings::zValue
The force/moment value in Z direction of the Analytical Surface Load.